Repository: Piwigo/Piwigo-Mobile
Catalog: piwigo/Resources/ReleaseNotes.xcstrings
Source language: en
Languages: ar, da, de, es, fr, hu, id, it, ja, nl, pl, ru, sv, zh_hans, zh_hant

# v2.7.2_text
source: Version 2.7.2 September 20, 2021 • iOS 15 compatibility • Minor bug fixes and improvements of the interface • Code modernization
ar: الإصدار 2.7.2 20 سبتمبر 2021 • التوافق مع iOS 15 • إصلاحات أخطاء طفيفة وتحسينات للواجهة • تحديث الكود
da: Version 2.7.2 20 september 2021 • iOS 15 kompatibilitet • Mindre fejlrettelser og forbedringer af brugerflade • Modernisering af kode
de: Version 2.7.2 20. September 2021 • iOS 15-Kompatibilität • Kleinere Fehlerbehebungen und Verbesserungen der Schnittstelle • Code-Modernisierung
es: Versión 2.7.2 20 de septiembre de 2021 • Compatibilidad con iOS 15 • Corrección de errores menores y mejoras de la interfaz • Modernización del código
fr: Version 2.7.2 20 septembre 2021 • Compatibilité avec iOS 15 • Corrections de bugs mineurs et améliorations de l'interface • Modernisation du code
hu: 2.7.2-es verzió 2021 Szeptember 20 • iOS 15 kompatibilitás • Kisebb hibajavítások és fejlesztések a felületen • Kódmodernizálás
it: Versione 2.7.2 20 settembre 2021 • Compatibilità iOS 15 • Correzioni di bug minori e miglioramenti dell'interfaccia • Modernizzazione del codice
ja: バージョン2.7.2 2021年9月20日 • iOS 15の互換性 • 軽微なバグの修正とインタフェースの改善 • コードの近代化
nl: Versie 2.7.2 20 september 2021 • iOS 15-compatibiliteit • Kleine foutjes hersteld en verbetering van de interface • Code modernisering
pl: Wersja 2.7.2 20 września 2021 • Kompatybilność z iOS 15 • Poprawki drobnych błędów i ulepszenia interfejsu • Modernizacja kodu
ru: Версия 2.7.2 20 сентября 2021 • совместимость с iOS 15 • Мелкие исправления и улучшения интерфейса • Модернизация кода
sv: Version 2.7.2 20 september 2021 • iOS 15-kompatibilitet • Mindre buggfixar och förbättringar av gränssnittet • Uppdatering av kod
zh_hans: 版本 2.7.2 2021年9月20日 • 支持iOS 15 • 小错误修复和界面改进 • 代码重构
zh_hant: 版本 2.12 2021年9月20日 • 支援iOS15 • 小型錯誤修正及介面改進 • 程式碼更新

# v2.8.0_text
source: Version 2.8 October 23, 2021 • Add and remove photos and videos from your favorites • Minor bug fixes and improvements of the interface
ar: الإصدار 2.8 23 أكتوبر 2021 • إضافة وإزالة الصور ومقاطع الفيديو من مفضلاتك • إصلاحات طفيفة للأخطاء وتحسينات للواجهة
da: Version 2.8 23 oktober 2021 • Tilføj og fjern fotos og videoer fra dine favoritter • Mindre fejlrettelser og forbedringer af brugerflade
de: Version 2.8 23. Oktober 2021 • Hinzufügen und Entfernen von Fotos und Videos aus den Favoriten • Kleinere Fehlerbehebungen und Verbesserungen der Benutzeroberfläche
es: Versión 2.8 23 de octubre de 2021 • Añadir y eliminar fotos y vídeos de los favoritos • Correcciones menores de errores y mejoras de la interfaz
fr: Version 2.8 23 octobre 2021 • Ajouter et supprimer des photos et des vidéos de vos favoris • Corrections de bugs mineurs et améliorations de l'interface
hu: 2.8-as verzió 2021 Október 23 • Kedvenc fotók és videók kezelése • Kisebb hibajavítások és fejlesztések a felületen
it: Versione 2.8 23 ottobre 2021 • Aggiungi e rimuovi foto e video dai tuoi preferiti • Correzioni di bug minori e miglioramento dell'interfaccia
ja: バージョン 2.8 2021年10月23日 • お気に入りから写真やビデオを追加して削除する •マイナーなバグ修正とインターフェイスの改善
nl: Versie 2.8 23 oktober 2021 • Foto's toevoegen aan en verwijderen uit favorieten • Bugfixes en verbeteringen van de interface
pl: Wersja 2.8 23 października 2021 • Dodawanie i usuwanie zdjęć i filmów z Twoich Ulubionych • Poprawki drobnych błędów i ulepszenia interfejsu
ru: Версия 2.8 23 октября 2021 • Добавление и удаление фото и видео из избранного • Исправление незначительных ошибок и улучшение интерфейса
sv: Version 2.8 23 oktober 2021 • Lägg till och ta bort foton och videor från dina favoriter • Mindre buggfixar och förbättringar av gränssnittet
zh_hans: 版本 2.8 2021年10月23日 • 从您的收藏夹中添加和删除照片和视频 • 小错误修复和界面改进
zh_hant: 版本 2.8 2021年10月23日 • 從最愛添加或移除照片及影片 • 小型錯誤修正及介面改進

# v2.8.1_text
source: Version 2.8.1 November 9, 2021 • Bug fixes
ar: الإصدار 2.8.1 9 نوفمبر 2021 • إصلاحات الأخطاء
da: Version 2.8.1 9 november 2021 • Fejlrettelser
de: Version 2.8.1 9. November 2021 • Fehlerbehebungen
es: Versión 2.8.1 9 de noviembre de 2021 • Corrección de errores
fr: Version 2.8.1 9 novembre 2021 • Correction de bugs
hu: 2.8.1-es verzió 2021 November 9 • Hibajavítások
it: Versione 2.8.1 9 novembre 2021 • Correzioni di bug
ja: バージョン 2.8.1 2021年11月9日 • バグの修正
nl: Versie 2.8.1 9 November 2021 • Foutjes verbeterd
pl: Wersja 2.8.1 9 listopada 2021 • Poprawki błędów
ru: Версия 2.8.1 9 ноября 2021 • Исправления ошибок
sv: Version 2.8.1 9 november 2021 • Buggfixar
zh_hans: 版本 2.8.1 2021年11月9日 • 错误修复
zh_hant: 版本 2.8.1 2021年11月9日 • 錯誤修正

# v2.8.2_text
source: Version 2.8.2 November 26, 2021 • Enables Community users to upload in the background and auto-upload photos and videos • Fixes a compatibility issue with Piwigo 12 • Minor bug fixes and improvements of the interface
ar: الإصدار 2.8.2 26 نوفمبر 2021 • تمكين مستخدمي المجتمع من التحميل في الخلفية والتحميل التلقائي للصور ومقاطع الفيديو • إصلاح مشكلة التوافق مع Piwigo 12 • إصلاحات طفيفة للأخطاء وتحسينات في الواجهة
da: Version 2.8.2 26 november 2021 • Gør det muligt for brugere i Fællesskabet at uploade i baggrunden og automatisk uploade fotos og videoer • Løser et kompatibilitetsproblem med Piwigo 12 • Mindre fejlrettelser og forbedringer af brugerflade
de: Version 2.8.2 26. November 2021 • Ermöglicht Community-Nutzern das Hochladen im Hintergrund und das automatische Hochladen von Fotos und Videos • Behebt ein Kompatibilitätsproblem mit Piwigo 12 • Kleinere Fehlerbehebungen und Verbesserungen der Benutzeroberfläche
es: Versión 2.8.2 26 de noviembre de 2021 • Permite a los usuarios de la comunidad subir en segundo plano y subir fotos y vídeos automáticamente • Corrige un problema de compatibilidad con Piwigo 12 • Correcciones de errores menores y mejoras de la interfaz
fr: Version 2.8.2 26 novembre 2021 • Permet aux utilisateurs Community de télécharger en arrière-plan et de télécharger automatiquement des photos et des vidéos • Corrige un problème de compatibilité avec Piwigo 12 • Corrections de bugs mineurs et améliorations de l'interface
hu: 2.8.2-es verzió 2021. november 26 • Lehetővé teszi a közösségi felhasználók számára, hogy a háttérben töltsenek fel fényképeket és videókat, és automatikusan feltöltsék őket • Kijavít egy kompatibilitási problémát a Piwigo 12-vel • Kisebb hibajavítások és fejlesztések a felületen
it: Versione 2.8.2 26 novembre 2021 • Consente agli utenti della Community di caricare in background e caricare automaticamente foto e video • Risolve un problema di compatibilità con Piwigo 12 • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン2.8.2 2021年11月26日 • コミュニティユーザーがバックグラウンドでアップロードし、写真やビデオを自動アップロードできるようにする • Piwigo 12との互換性の問題を修正する • 軽微なバグの修正とインタフェースの改善
nl: Versie 2.8.2 26 November 2021 • Maakt het mogelijk voor gebruikers van de community om op de achtergrond te uploaden en automatisch foto's en video's te uploaden • Een compatibiliteitsprobleem met Piwigo 12 • Kleine foutjes verbeterd en verbetering van de interface
pl: Wersja 2.8.2 26 listopada 2021 • Umożliwia użytkownikom Community przesyłanie w tle i automatyczne przesyłanie zdjęć i filmów • Naprawia problem z kompatybilnością z Piwigo 12 • Poprawki drobnych błędów i ulepszenia interfejsu
ru: Версия 2.8.2 26 ноября 2021 • Позволяет пользователям сообщества загружать в фоновом режиме и использовать автозагрузку фото и видео • Исправлена проблема совместимости с Piwigo 12 • Исправление ошибок и улучшение интерфейса
sv: Version 2.8.2 26 november 2021 • Gör det möjligt för gemenskapsanvändare att ladda upp foton och videor automatiskt • Fixar ett kompatibilitetsproblem med Piwigo 12 • Mindre buggfixar och förbättringar av gränssnittet
zh_hans: 版本2.8.2 2021年11月26日 • 允许社区用户在后台上传并自动上传照片和视频 • 修复与 Piwigo 12的兼容性问题 • 小错误修复和界面改进
zh_hant: 版本 2.12 2021年11月26日 • 允許社群用戶在背景上傳及自動上傳照片及影片 • 修正了與Piwigo的相容性問題 • 小型錯誤修正及介面改進

# v2.9.0_text
source: Version 2.9 January 9, 2022 • Displays photo/video descriptions in preview mode • Minor bug fixes and improvements of the interface
ar: الإصدار 2.9 9 يناير 2022 • عرض أوصاف الصور/الفيديو في وضع المعاينة • إصلاحات أخطاء طفيفة وتحسينات في الواجهة
da: Version 2.9 9 januar 2022 • Viser foto-/videobeskrivelser i preview-tilstand • Mindre fejlrettelser og forbedringer af brugerflade
de: Version 2.9 9. Januar 2022 • Zeigt Foto- und Videobeschreibungen im Vorschaumodus an • Kleinere Fehlerbehebungen und Verbesserungen der Schnittstelle
es: Versión 2.9 9 de enero 2022 • Muestra las descripciones de foto/vídeo en modo de vista previa • Correcciones menores de errores y mejoras de la interfaz
fr: Version 2.9 9 janvier 2022 • Affiche les descriptions des photos et vidéos en mode aperçu • Corrections de bugs mineurs et améliorations de l'interface
hu: 2.9-es verzió 2022 Január 9 • Megjeleníti a fényképek/videók leírását előnézeti módban • Kisebb hibajavítások és fejlesztések a felületen
it: Versione 2.9 9 gennaio 2022 • Visualizza descrizioni foto/video in modalità anteprima • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 2.9 2022年1月9日 • プレビューモードで写真/ビデオの説明を表示する • マイナーなバグ修正とインターフェイスの改善
nl: Versie 2.9 9 januari 2022 • Geeft foto-/videobeschrijvingen weer in de voorbeeldmodus • Kleine foutjes verbeterd en verbetering van de interface
pl: Wersja 2.9 9 stycznia 2022 • Możliwość wyświetlania opisów zdjęć/filmów w trybie podglądu • Poprawki drobnych błędów i ulepszenia interfejsu
ru: Версия 2.9 9 января 2022 • Отображение описания фотографии/видео в режиме предварительного просмотра • Исправления незначительных ошибок и улучшения интерфейса
sv: Version 2.9 9 januari 2022 • Visar foto-/videobeskrivningar i förhandsgranskningsläge • Mindre buggfixar och förbättringar av gränssnittet
zh_hans: 版本 2.9 2022年1月9日 • 在预览模式下显示照片/视频说明 • 小错误修复和界面改进
zh_hant: 版本 2.9 2022年1月9日 • 預覽模式下顯示照片及影片的描述 • 小型錯誤修正及介面改進

# v2.9.1_text
source: Version 2.9.1 January 20, 2022 • Highlights albums updated recently • Minor bug fixes and improvements of the interface
ar: الإصدار 2.9.1 20 يناير 2022 • أبرز الألبومات التي تم تحديثها مؤخرًا • إصلاحات أخطاء طفيفة وتحسينات في الواجهة
da: Version 2.9.1 20 januar 2022 • Markerer albummer opdateret for nylig • Mindre fejl rettet og forbedringer af brugerflade
de: Version 2.9.1 20. Januar 2022 • Hervorheben der kürzlich aktualisierten Alben • Kleinere Fehlerkorrekturen und Verbesserungen an der Benutzeroberfläche
es: Versión 2.9.1 20 de enero 2022 • Resalta álbumes actualizados recientemente • Corrección de errores menores y mejoras en la interfaz
fr: Version 2.9.1 20 janvier 2022 • Met en avant les albums modifiés récemment • Corrections de bugs mineurs et amélioration de l'interface
hu: 2.9.1-es verzió 2022 Január 20 • Kiemeli a nemrég frissített albumokat • Kisebb hibajavítások és fejlesztések a felületen
id: Versi 2.9.1 20 Januari 2022 • Perbaikan bug minor dan perbaikan antarmuka
it: Versione 2.9.1 20 gennaio 2022 • Album in evidenza aggiornati di recente • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 2.9.1 2022年1月20日 • 最近更新されたアルバムのハイライト • 軽微なバグの修正とインタフェースの改善
nl: Versie 2.9.1 20 januari 2022 • Accentueringen die onlangs zijn bijgewerkt • Kleine foutjes hersteld en verbetering van de interface
pl: Wersja 2.9.1 20 stycznia 2022 • Podświetlanie ostatnio zaktualizowanych albumów • Poprawki drobnych błędów i ulepszenia interfejsu
ru: Версия 2.9.1 20 января 2022 • Недавно обновленные альбомы Highlights • Исправление незначительных ошибок и улучшения интерфейса
sv: Version 2.9.1 20 januari 2022 • Höjdpunkter album som uppdaterats nyligen • Mindre bugfixar och förbättringar av gränssnittet
zh_hans: 版本 2.9.1 2022年1月20日 • 高亮相册最近更新 • 小错误修复和界面改进
zh_hant: 版本 2.9.1 2022年1月20日 • 提示近期更新的相簿 • 小型錯誤修正及介面改進

# v2.9.2_text
source: Version 2.9.2 January 24, 2022 • Bug fixes • Code modernization
ar: الإصدار 2.9.2 24 يناير 2022 • إصلاحات الأخطاء • تحديث الكود
da: Version 2.9.2 24 januar 2022 • Fejlrettelser • Modernisering af kode
de: Version 2.9.2 24. Januar 2022 • Fehlerbehebungen • Code-Modernisierung
es: Versión 2.9.2 24 de enero 2022 • Corrección de errores • Modernización del código
fr: Version 2.9.2 24 janvier 2022 • Correction de bugs • Modernisation du code
hu: 2.9.2-es verzió 2022 Január 24 • Hibajavítások • Kódmodernizálás
it: Versione 2.9.2 24 gennaio 2022 • Correzioni bug • Modernizzazione del codice
ja: バージョン 2.9.2 2022年1月24日 • バグの修正 • コードの近代化
nl: Versie 2.9.2 24 januari 2022 • Foutjes verbeterd • Codemodernisering
pl: Wersja 2.9.2 24 stycznia 2022 • Poprawki błędów • Modernizacja kodu
ru: Versão 2.9.2 24 января 2022 • Исправления ошибок • Модернизация кода
sv: Version 2.9.2 24 januari 2022 • Buggfixar • Uppdatering av kod
zh_hans: 版本 2.9.2 2022年1月24日 • 错误修复 • 代码重构
zh_hant: 版本 2.9.2 2022年1月24日 • 錯誤修正 • 程式碼更新

# v2.9.3_text
source: Version 2.9.3 February 11, 2022 • Double tap to zoom in and out photos • Minor bug fixes and improvements of the interface • Code modernization
ar: الإصدار 2.9.3 11 فبراير 2022 • النقر المزدوج لتكبير وتصغير الصور • إصلاحات أخطاء طفيفة وتحسينات في الواجهة • تحديث الكود
da: Version 2.9.3 11 februar 2022 • Dobbelttryk for at zoome ind og ud af fotos • Mindre fejl rettet og forbedringer af brugerflade • Modernisering af kode
de: Version 2.9.3 11. Februar 2022 • Doppel tippen zum Vergrößern und Verkleinern von Fotos • Kleinere Fehlerkorrekturen und Verbesserungen an der Benutzeroberfläche • Code-Modernisierung
es: Versión 2.9.3 11 de febrero de 2022 • Aumento y disminución del zoom de las fotos efectuando una doble pulsación • Corrección de errores menores y mejoras de la interfaz • Modernización del código
fr: Version 2.9.3 11 février 2022 • Zoomer et dézoomer les photos avec un double-appui • Corrections de bugs mineurs et améliorations de l'interface • Modernisation du code
hu: 2.9.3-as verzió 2022 Február 11 • Koppintson duplán a fényképek nagyításához és kicsinyítéséhez • Kisebb hibajavítások és fejlesztések a felületen • Kódmodernizálás
it: Versione 2.9.3 11 febbraio 2022 • Tocca due volte per ingrandire e ridurre le foto • Correzioni di bug minori e miglioramenti dell'interfaccia • Modernizzazione del codice
ja: バージョン2.9.3 2022年2月11日 • ダブルタップして写真をズームインおよびズームアウトします • 軽微なバグの修正とインタフェースの改善 • コードの近代化
nl: Versie 2.9.3 11 februari 2022 • Dubbel tikken om foto's in en uit te zoomen • Kleine foutjes hersteld en verbetering van de interface • Code modernisering
pl: Wersja 2.9.3 11 lutego 2022 • Dotknij dwukrotnie, aby powiększyć i pomniejszyć zdjęcie • Poprawki drobnych błędów i ulepszenia interfejsu • Modernizacja kodu
ru: Версия 2.9.3 11 февраля 2022 • Двойной клик для увеличения и для выхода из просмотра изображения • Мелкие исправления и улучшения интерфейса • Модернизация кода
sv: Version 2.9.3 11 februari 2022 • Tryck snabbt två gånger för att zooma in och ut foton • Mindre buggfixar och förbättringar av gränssnittet • Modernisering av kod
zh_hans: 版本2.9.3 2022年2月11日 • 双击缩放和放置照片 • 小错误修复和界面改进 • 代码重构
zh_hant: 版本 2.9.3 2022年2月11日 • 點兩下來放大及縮小照片 • 小型錯誤修正及介面改進 • 程式碼更新

# v2.9.4_text
source: Version 2.9.4 February 23, 2022 • Bug fixes • Code modernization
ar: الإصدار 2.9.4 23 فبراير 2022 • إصلاحات الأخطاء • تحديث الكود
da: Version 2.9.4 23 februar 2022 • Fejlrettelser • Modernisering af kode
de: Version 2.9.4 23. Februar 2022 • Fehlerbehebungen • Code-Modernisierung
es: Versión 2.9.4 23 de febrero de 2022 • Corrección de errores • Modernización del código
fr: Version 2.9.4 23 février 2022 • Correction de bugs • Modernisation du code
hu: 2.9.4-es verzió 2022 Február 23 • Hibajavítások • Kódmodernizálás
it: Versione 2.9.4 23 febbraio 2022 • Correzioni bug • Modernizzazione del codice
ja: バージョン 2.9.4 2022年2月23日 • バグの修正 • コードの近代化
nl: Versie 2.9.4 23 februari 2022 • Foutjes verbeterd • Codemodernisering
pl: Wersja 2.9.4 23 lutego 2022 • Poprawki błędów • Modernizacja kodu
ru: Versão 2.9.4 23 февраля 2022 • Исправления ошибок • Модернизация кода
sv: Version 2.9.4 23 februari 2022 • Buggfixar • Uppdatering av kod
zh_hans: 版本 2.9.4 2022年2月23日 • 错误修复 • 代码重构
zh_hant: 版本 2.9.4 2022年2月23日 • 錯誤修正 • 程式碼更新

# v2.9.5_text
source: Version 2.9.5 March 7, 2022 • Bug fixes • Code modernization
ar: الإصدار 2.9.5 7 مارس 2022 • إصلاحات الأخطاء • تحديث الكود
da: Version 2.9.5 7 marts 2022 • Fejlrettelser • Modernisering af kode
de: Version 2.9.5 7. März 2022 • Fehlerbehebungen • Code-Modernisierung
es: Versión 2.9.5 7 de marzo de 2022 • Corrección de errores • Modernización del código
fr: Version 2.9.5 7 mars 2022 • Correction de bugs • Modernisation du code
hu: 2.9.5-ös verzió 2022 Március 7 • Hibajavítások • Kódmodernizálás
it: Versione 2.9.5 7 marzo 2022 • Correzioni bug • Modernizzazione del codice
ja: バージョン 2.9.5 2022年3月7日 • バグの修正 • コードの近代化
nl: Versie 2.9.5 7 maart 2022 • Foutjes verbeterd • Codemodernisering
pl: Wersja 2.9.5 7 marca 2022 • Poprawki błędów • Modernizacja kodu
ru: Версия 2.9.5 7 марта 2022 • Исправления ошибок • Модернизация кода
sv: Version 2.9.5 7 mars 2022 • Buggfixar • Uppdatering av kod
zh_hans: 版本 2.9.5 2022年3月7日 • 错误修复 • 代码重构
zh_hant: 版本 2.9.5 2022年3月7日 • 錯誤修正 • 程式碼更新

# v2.10.0_text
source: Version 2.10 May 20, 2022 • Adds App Lock, a feature for hiding your albums behind Face ID, Touch ID and a passcode • Bug fixes • Code modernization
ar: الإصدار 2.10 20 مايو 2022 • يضيف ميزة ”قفل التطبيق“، وهي ميزة لإخفاء ألبوماتك خلف معرف الوجه ومعرف اللمس ورمز المرور • إصلاح الأخطاء • تحديث الكود
da: Version 2.10 20 maj 2022 • Tilføjer App Lock, en funktion til at skjule dine albummer bag Face ID, Touch ID og en adgangskode • Fejlrettelser • Kode modernisering
de: Version 2.10 20. Mai 2022 • Fügt eine App-Sperre hinzu, eine Funktion zum Verstecken deiner Alben hinter Face ID, Touch ID und Zugangscode • Fehlerbehebungen • Code Modernisierung
es: Versión 2.10 20 de mayo de 2022 • Añade App Lock, una característica para ocultar tus álbumes detrás de Face ID, Touch ID y un código de acceso • Correcciones de errores • Modernización de código
fr: Version 2.10 20 mai 2022 • Ajoute le verrouillage de l'application, une fonctionnalité pour cacher vos albums derrière Face ID, Touch ID et/ou un code d'accès • Corrections de bugs • Modernisation du code
hu: 2.10-es verzió 2022. május 20 • Hozzáadja az App Lock funkciót, amellyel az albumokat Face ID, Touch ID és jelszó mögé rejtheti • Hibajavítások • Kódmodernizáció
it: Versione 2.10 20 maggio 2022 • Aggiunge App Lock, una funzione per nascondere i tuoi album dietro Face ID, Touch ID e un passcode • Correzioni di bug • Modernizzazione del codice
ja: バージョン2.10 2022年5月20日 •FaceID、Touch ID、パスコードの背後にアルバムを隠す機能であるAppLockを追加します • バグの修正 •コードの近代化
nl: Versie 2.10 20 mei 2022 • Voegt App Lock toe, een functie om je albums achter Face ID te verbergen, Touch ID en een toegangscode • Foutjes verholpen • Code-modernisering
pl: Wersja 2.10 20 maja 2022 • Dodaje App Lock, funkcję ukrycia albumów za Face ID, Touch ID i kodem dostępu • Poprawki błędów • Modernizacja kodu
ru: Версия 2.10 20 мая 2022 • Добавлена блокировка приложения, функция скрытия ваших альбомов с помощью Face ID, Touch ID и пароля • Исправление ошибок • Модернизация кода
sv: Version 2.10 20 maj 2022 • Lägger till App Lock, en funktion för att dölja dina album bakom Face ID, Touch ID och en lösenkod • Felrättelser • Modernisering av kod
zh_hans: 版本 2.10 2022 年 5 月 20 日 • 添加 App Lock，这是一项将您的相册隐藏在 Face ID、Touch ID 和密码后面的功能 • Bug修复 • 代码现代化
zh_hant: 版本 2.10 2022年5月20日 • 增加程式鎖，可以使用密碼，Face ID或Touch ID來隱藏您的相簿 • 錯誤修正 • 程式碼更新

# v2.11.0_text
source: Version 2.11 June 11, 2022 • Adds an option for re-uploading photos and videos • Code modernization • Bug fixes
ar: الإصدار 2.11 11 يونيو 2022 • يضيف خيارًا لإعادة تحميل الصور ومقاطع الفيديو • تحديث الكود • إصلاح الأخطاء
da: Version 2.11 11 juni 2022 • Tilføjer en mulighed for at genuploade fotos og videoer • Modernisering af kode • Fejlrettelser
de: Version 2.11 11. Juni 2022 • Fügt eine Option zum erneuten Hochladen von Fotos und Videos hinzu • Code-Modernisierung • Fehlerbehebungen
es: Versión 2.11 11 de junio de 2022 • Añadida una opción para volver a subir fotos y vídeos • Modernización de código • Correcciones de errores
fr: Version 2.11 11 juin 2022 • Ajoute une option pour re-télécharger des photos et des vidéos • Modernisation du code • Corrections de bugs
hu: 2.11-es verzió 2022. június 11 • Lehetőséget ad fényképek és videók újrafeltöltésére • Kódmodernizáció • Hibajavítások
it: Versione 2.11 11 giugno 2022 • Aggiunge un'opzione per il caricamento di foto e video • Modernizzazione del codice • Correzioni di bug
ja: バージョン2.11 2022年6月11日 •写真とビデオを再アップロードするためのオプションを追加します •コードの近代化 • バグの修正
nl: Versie 2.11 11 juni 2022 • Voegt een optie toe voor het opnieuw uploaden van foto's en video's • Code modernisering • Foutjes verbeterd
pl: Wersja 2.11 11 czerwca 2022 • Dodaje opcję ponownego przesyłania zdjęć i filmów • Modernizacja kodu • Poprawki błędów
ru: Версия 2.11 11 июня 2022 • Добавлена возможность перезагрузки фото и видео • Модернизация кода • Исправления ошибок
sv: Version 2.11 11 juni 2022 • Lägger till en alternativ för att ladda upp foton och videor på nytt • Uppdatering av kod • Felrättelser
zh_hans: 版本 2.11 2022 年 6 月 11 日 • 添加重新上传照片和视频的选项 • 代码现代化 • 错误修复
zh_hant: 版本 2.11 2022年6月11日 • 增加了重新上傳照片/影片的功能 • 程式碼更新 • 錯誤修正

# v2.11.1_text
source: Version 2.11.1 June 12, 2022 • Bug fixes
ar: الإصدار 2.11.1 • اصلاحات الشوائب
da: Version 2.11.1 12 juni 2022 • Fejlrettelser
de: Version 2.11.1 12. Juni 2022 • Fehlerbehebungen
es: Versión 2.11.1 12 de junio de 2022 • Corrección de errores
fr: Version 2.11.1 12 juin 2022 • Correction de bugs
hu: 2.11.1-es verzió 2022. június 12 • Hibajavítások
id: Versi 2.11.1 • Perbaikan bug
it: Versione 2.11.1 12 giugno 2022 • Correzioni di bug
ja: バージョン 2.11.1 2022年6月12日 • バグの修正
nl: Versie 2.12.3 7 augustus 2022 • Foutjes verbeterd
pl: Wersja 2.11.1 12 czerwca 2022 • Poprawki błędów
ru: Версия 2.11.1 12 июня 2022 • Исправления ошибок
sv: Version 2.11.1 12 juni 2022 • Buggfixar
zh_hans: 版本 2.11.1 2022 年 6 月 12 日 • 错误修复
zh_hant: 版本 2.11.1 2022年6月12日 • 錯誤修正

# v2.11.2_text
source: Version 2.11.2 June 21, 2022 • Fixes a compatibility issue with the Community plugin
ar: الإصدار 2.11.2 21 يونيو 2022 • يعمل على إصلاح مشكلة التوافق مع إضافة المجتمع
da: Version 2.11.2 21 juni 2022 • Retter et kompatibilitetsproblem med Community-pluginnet
de: Version 2.11.2 21. Juni 2022 • Behebt ein Kompatibilitätsproblem mit dem Community-Plugin
es: Versión 2.11.2 21 de junio de 2022 • Soluciona un problema de compatibilidad con el complemento Community
fr: Version 2.11.2 21 juin 2022 • Corrige un problème de compatibilité avec le plugin Community
hu: 2.11.2 verzió 2022. június 21 • Kijavít egy kompatibilitási problémát a Community beépülő modullal
it: Versione 2.11.2 21 giugno 2022 • Risolve un problema di compatibilità con il plugin Community
ja: バージョン2.11.2 2022年6月21日 •Communityプラグインとの互換性の問題を修正します
nl: Versie 2.11.2 21 juni 2022 • Lost een compatibiliteitsprobleem op met de Community-plug-in
pl: Wersja 2.11.2 21 czerwca 2022 • Rozwiązuje problem ze zgodnością z wtyczką Community
ru: Версия 2.11.2 21 июня 2022 • Устранена проблема совместимости с подключаемым модулем Community
sv: Version 2.11.2 21 juni 2022 • Åtgärdar ett kompatibilitetsproblem med Community-plugin
zh_hans: 版本 2.11.2 2022 年 6 月 21 日 • 修复了与 Community 插件的兼容性问题
zh_hant: 版本 2.11.2 2022年6月21日 • 修正了一個使用社群插件時的相容性問題
